# QUESTION NO 1

a)find the largest number in the 2D array

In [2]:
import random

In [4]:
import numpy as np

In [6]:
import pandas as pd

In [8]:
import string

In [14]:
arr_rand = np.array([[5,2,3],[10,13,7]])
arr_rand

array([[ 5,  2,  3],
       [10, 13,  7]])

In [34]:
#finding the largest number in the given array, arr_rand :
# array([[ 5,  2,  3],
      # [10, 13,  7]])
rows,cols = arr_rand.shape
largest = arr_rand[0,0]
index = (0,0)
for i in range(rows):
    for c in range(cols):
        if(arr_rand[i,c] > largest):
            largest = arr_rand[i,c]
            flag = (i,c)
            print(largest, "found at", index)
        break

10 found at (0, 0)

In [26]:
import numpy as np

arr_rand = np.array([[5, 2, 3], [10, 13, 7]])
rows, cols = arr_rand.shape

largest = arr_rand[0, 0]
position = (0, 0)

for i in range(rows):
    for c in range(cols):
        if arr_rand[i, c] > largest:
            largest = arr_rand[i, c]
            position = (i, c)

print(f"{largest} found at position {position}")

13 found at position (1, 1)

b) Make a list of 5 students name also add your full name as a first item in the
list. Perform the following instructions;
1. Convert it into Numpy Array
2. Take a user input to find the name of any student from the array
3. If the value found display on output with its index location
4. If not found display on output screen “Not Found”

In [84]:
name_list = ["Urwa Kashaf","Samra Shahzad", "Uswah Batool", "Eman MIrza","Ayesha Tariq"]

In [86]:
name_list = np.array(["Urwa Kashaf","Samra Shahzad", "Uswah Batool", "Eman MIrza","Ayesha Tariq"])

In [88]:
name_list

array(['Urwa Kashaf', 'Samra Shahzad', 'Uswah Batool', 'Eman MIrza',
       'Ayesha Tariq'], dtype='<U13')

In [96]:
# find a name from the array
name = input("Enter name to find:")

len =name_list.shape[0]
flag = 0

for i in range(len):
    if(name == name_list[i]):
        flag = 1 
        print(name,"found at", i)
        break
        # break is used to immediate terminate the loop
if( flag == 0):
        print(name,"is not found")

Enter name to find: aimal ilyas

aimal ilyas is not found

# QUESTION 2
a) What is Artificial Intelligence? Explain briefly the major branches of AI.

ANSWER : 
   Artificial Intelligence is a type of intelligence that can perform tasks efficiently initially requiring human input, AI is used in many fields in today's time AI has been assisting humans more efficiently in every field.
   Major Branches of AI:
robotics : AI is used vastly in robotics, robotics have taken over many human jobs even leading to lack of jobs and incomes for humans.
machine learning : AI is used in machine learning for fields like data science etc

b) Why is Artificial Intelligence becoming more popular these days? Provide
some practical applications where AI is being used.

ANSWER : in todays date and time artificial has taken over in every field, from medical, computers, restaurants, artificial intelligence is being used in every field for various purposes for its effcient and fast working, we can get any kind of data from AI more easily in seconds after giving the input.
AI has even taken over human jobs, robots are being used in restaurants to serve the customer sinstead of human waiters in developed countries such as japan.
AI is used in machinery or the making of hospital equipment.

## QUESTION 3
Write a function to calculate the 10% discount on the total amount of the items
purchased greater than 6000. Using the concept of pass by value to give as an
input parameter. Finally display the discount given and final amount outside the
function. Make the name of the function as discount_fn

In [120]:
def discount_fn(amount):  
    if(amount >= 6000):
        discounted_price = amount * 0.1 #or 10/100
        final_amount = amount - discounted_price
    else:
        discounted_price = 0
        final_amount = amount
    return discounted_price, final_amount #return is outside if statement
    #bcz both conditions are finalixed
# if i put it inside the if else statement it woukd gve error

In [122]:
price = int(input("enter price:"))

dis_price, fn_amount = discount_fn(price)

print(dis_price)
print(fn_amount)

enter price: 6700

670.0
6030.0

## QUESTION 4
Write a program to generate a random password of minimum length 8 characters
and maximum length not more than 12 characters. The password should satisfy
the following criteria;
1. Uppercase Alphabets
2. Lowercase Alphabets
3. Digits
4. Special Characters (Dollar ($), Underscore ( _ ), Period (.))

In [159]:
characters = string.ascii_letters + string.digits + "$_."
pass_len = random.randint(8,12)
password = ""

for i in range(pass_len):
    random_char = random.choice(characters)
    password = password + random_char
print("password:", password)

password: W$LIfGJRJ

## QUESTION NO 5
The titanic.csv dataset contains information about passengers aboard the Titanic,
often used to explore survival rates and other factors related to the tragedy. Key
variables include passenger survival status, class (1st, 2nd, or 3rd), age, gender,
number of siblings/spouses aboard, number of parents/children aboard, fare paid,
and port of embarkation. This dataset is commonly used for classification tasks
and to analyze how factors like age, gender, and class influenced the likelihood
of survival during the Titanic disaster.

In [311]:
df = pd.read_csv("titanic_train.csv") # to save the file in csv

In [313]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Perform the following set of tasks on the above mentioned dataset;
1. How many features have missing values?
2. Find out what percent of the missing values for each features.
3. Try removing all the rows from the dataset that contain missing values.
4. How many rows left after removing missing values?
5. Find the mean, median and standard deviation value of Fare feature
6. How many number of male and female were on the ship?
7. How many number of passengers who were able to survived and not
survived

# 1) missing values 
2 columns have missing values
age and cabin

In [366]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            174
SibSp            0
Parch            0
Fare             0
Cabin          680
Embarked         2
dtype: int64

# 2)find out percent for missing values for each feature

In [371]:
df["Age"].value_counts(normalize=True)*100

Age
24.00    4.225352
22.00    3.661972
18.00    3.661972
19.00    3.521127
28.00    3.521127
           ...
36.50    0.140845
55.50    0.140845
0.92     0.140845
23.50    0.140845
74.00    0.140845
Name: proportion, Length: 88, dtype: float64

In [363]:
df["Cabin"].value_counts(normalize=True)*100

Cabin
B96 B98        1.960784
G6             1.960784
C23 C25 C27    1.960784
C22 C26        1.470588
F33            1.470588
                 ...
E34            0.490196
C7             0.490196
C54            0.490196
E36            0.490196
C148           0.490196
Name: proportion, Length: 147, dtype: float64

# 3) Try removing all the rows from the dataset that contain missing values.
##to remove the column
#if you want to remove a column axis = 1
#to delete a row axis = 0
#to make permenant changes add true

In [323]:
df = df.set_index("Ticket") 
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
Ticket,,,,,,,,,,,
A/5 21171,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
PC 17599,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
STON/O2. 3101282,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
113803,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
373450,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
211536,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S
112053,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S
W./C. 6607,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S
111369,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C
370376,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q

In [325]:
df.drop("A/5 21171", axis=0,inplace=True)

In [327]:
df.drop("373450", axis=0,inplace=True)

In [329]:
df.drop("330877", axis=0,inplace=True)

In [331]:
df.drop("211536", axis=0,inplace=True)

In [333]:
df.drop("W./C. 6607", axis=0,inplace=True)

In [335]:
df.drop("370376", axis=0,inplace=True)

In [337]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
Ticket,,,,,,,,,,,
PC 17599,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
STON/O2. 3101282,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
113803,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
17463,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,E46,S
349909,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
C.A./SOTON 34068,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,10.5000,NaN,S
SOTON/OQ 392076,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,7.0500,NaN,S
382652,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,29.1250,NaN,Q
112053,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S
111369,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C

In [339]:
dff = df.add(df,fill_value=0) # to correct NAn use .add function

In [341]:
dff

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
Ticket,,,,,,,,,,,
PC 17599,4,2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",femalefemale,76.0,2,0,142.5666,C85C85,CC
STON/O2. 3101282,6,2,6,"Heikkinen, Miss. LainaHeikkinen, Miss. Laina",femalefemale,52.0,0,0,15.8500,NaN,SS
113803,8,2,2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)Fu...",femalefemale,70.0,2,0,106.2000,C123C123,SS
17463,14,0,2,"McCarthy, Mr. Timothy JMcCarthy, Mr. Timothy J",malemale,108.0,0,0,103.7250,E46E46,SS
349909,16,0,6,"Palsson, Master. Gosta LeonardPalsson, Master....",malemale,4.0,6,2,42.1500,NaN,SS
...,...,...,...,...,...,...,...,...,...,...,...
C.A./SOTON 34068,1768,0,4,"Banfield, Mr. Frederick JamesBanfield, Mr. Fre...",malemale,56.0,0,0,21.0000,NaN,SS
SOTON/OQ 392076,1770,0,6,"Sutehall, Mr. Henry JrSutehall, Mr. Henry Jr",malemale,50.0,0,0,14.1000,NaN,SS
382652,1772,0,6,"Rice, Mrs. William (Margaret Norton)Rice, Mrs....",femalefemale,78.0,0,10,58.2500,NaN,QQ
112053,1776,2,2,"Graham, Miss. Margaret EdithGraham, Miss. Marg...",femalefemale,38.0,0,0,60.0000,B42B42,SS
111369,1780,2,2,"Behr, Mr. Karl HowellBehr, Mr. Karl Howell",malemale,52.0,0,0,60.0000,C148C148,CC

## 4) How many rows left after removing missing values?

In [344]:
df.shape

(884, 11)

## 5) Find the mean, median and standard deviation value of Fare feature

In [347]:
print("mean:",df["Fare"].mean())

mean: 32.35581561085973

In [349]:
print("median:",df["Fare"].median())

median: 14.45625

In [351]:
print("standard deviation:", df["Fare"].std())

standard deviation: 49.85696852837724

# 6) How many number of male and female were on the ship?

In [354]:

df["Sex"].value_counts()
# to check the ratio

Sex
male      571
female    313
Name: count, dtype: int64

In [356]:
df["Sex"].value_counts(normalize=True)*100
# tells the ratio in percentage

Sex
male      64.59276
female    35.40724
Name: proportion, dtype: float64

## 7. How many number of passengers who were able to survived and not survived

In [359]:
df["Survived"].value_counts()

Survived
0    542
1    342
Name: count, dtype: int64